In [1]:
import pandas as pd
import numpy as np

In [5]:
data1 = {'ID': [1,2,3,4,5], 'Name': ['Ted', 'Liz', 'Kate', 'Tom', np.nan], 'Subject': ['Math', 'Biology', 'Math', 'Chemistry', np.nan]}
df1 = pd.DataFrame(data1)

In [6]:
df1

   ID  Name    Subject
0   1   Ted       Math
1   2   Liz    Biology
2   3  Kate       Math
3   4   Tom  Chemistry
4   5   NaN        NaN

In [7]:
data2 = {'Subject' : ['Math', 'Biology','Chemistry', 'English'],
'Teacher': ['Smith', 'Kelly', 'Edvig', 'Avau']}
df2 = pd.DataFrame(data2)

In [8]:
df2

     Subject Teacher
0       Math   Smith
1    Biology   Kelly
2  Chemistry   Edvig
3    English    Avau

In [9]:
list1 = [6, 'John', 'Math']
list2 = [7, 'Robert', 'Biology']
df1.loc[len(df1)] = list1
df1.loc[len(df1)] = list2

In [10]:
df1

   ID    Name    Subject
0   1     Ted       Math
1   2     Liz    Biology
2   3    Kate       Math
3   4     Tom  Chemistry
4   5     NaN        NaN
5   6    John       Math
6   7  Robert    Biology

In [11]:
df1.merge(df2, on='Subject', how='left')

   ID    Name    Subject Teacher
0   1     Ted       Math   Smith
1   2     Liz    Biology   Kelly
2   3    Kate       Math   Smith
3   4     Tom  Chemistry   Edvig
4   5     NaN        NaN     NaN
5   6    John       Math   Smith
6   7  Robert    Biology   Kelly